
#Создать список и заполнить его элементами различных типов данных.
#Реализовать скрипт проверки типа данных каждого элемента.
#Использовать функцию type() для проверки типа.
#Элементы списка можно не запрашивать у пользователя,
#а указать явно, в программе.

list_my = [12, -77, 'work', 9.5]
for i in list_my:
    print (type(i))